/*
  FilterPresets.strings
  iina

  Created by lhc on 25/8/2017.
  Copyright © 2017 lhc. All rights reserved.
*/
/* It's optional to localize descriptions for each parameter! */



"crop" = "裁切";
"crop.w" = "宽（默认：视频宽度）";
"crop.h" = "高（默认：视频高度）";
"crop.x" = "起始 X（默认：从中心裁切）";
"crop.y" = "起始 Y（默认：从中心裁切）";

"expand" = "展开";
"expand.w" = "宽度（默认：视频宽度）";
"expand.h" = "高度（默认：视频高度）";
"expand.x" = "起始横坐标（默认：从中心扩展）";
"expand.y" = "起始纵坐标（默认：从中心扩展）";
"expand.aspect" = "扩展以适应比例（例：4:3）";
"expand.round" = "向上取整使得能被此值整除";

"sharpen" = "锐化";
"sharpen.msize" = "矩阵尺寸";
"sharpen.amount" = "锐化度";

"blur" = "模糊";
"blur.msize" = "矩阵尺寸";
"blur.amount" = "模糊量";

"delogo" = "去除水印";
"delogo.w" = "宽";
"delogo.h" = "高";
"delogo.x" = "起始横坐标";
"delogo.y" = "起始纵坐标";

"negative" = "负片";

"vflip" = "垂直翻转";
"hflip" = "水平镜像翻转";

"lut3d" = "3D LUT调色档";
"lut3d.file" = "文件路径（你也可以拖拽文件到输入区域）";
"lut3d.interp" = "插值模式";

"custom_mpv" = "定制（mpv）";
"custom_mpv.name" = "滤镜名称";
"custom_mpv.string" = "滤镜值";

"custom_ffmpeg" = "自定义（FFmpeg）";
"custom_ffmpeg.name" = "滤镜名称";
"custom_ffmpeg.string" = "滤镜值";
